{
    "stories": [
        {
            "company": "Peloton",
            "tags": ["Next.js", "Dynamic Sites", "Vercel ⚔️"],
            "industry": "Consumer Electronics",
            "storyContents": {
                "project": "Raj Nigam, Frontend Developer, wanted to quickly build a new site for Peloton without using infra resources.",
                "whyImportant": "This was important becuase as a hyper growth startup, they needed to have a quick dev workflow, the ability to build and host reliably without any downtime, and an easy to manage stack.",
                "whyStatusQuoBad": "They could not accomplish this using Cloudflare, etc because their infra stack required constant mantenence and a dedicated team. It limited the ability of their cross functional teams (marketing, content, eng, support) to get things done.",
                "quantifiedResults": "Now, Peloton has standardized on a jamstack architecture using Netlify. Their team of 200+ devs deploys 1300 times a day across 75 unique sites."
            }
        },
        {
            "company": "Restaurant Brands International",
            "tags": ["Standardizing Techstack"],
            "industry": "Food",
            "storyContents": {
                "project": "Teddy Sherril, CTO, wanted to move from using agency developers to an in house team with a standardized tech stack across brands and sites.",
                "whyImportant": "This was important becuase RBI planned a revamp of brands, sites, even menus that required a rapid pace of development that was not currently possible.",
                "whyStatusQuoBad": "This was not possible before using agency developers who took months to deliver projects with a variety of technologies.",
                "quantifiedResults": "Netlify enabled RBI's lean internal dev team to have a standard tech stack across 25+ sites around the world that could handle intense traffic spikes, including one site that saw 500k users in 5 minutes on launch."
            }
        },
        {
            "company": "Ecobee",
            "tags": ["Self-serve Upsell"],
            "industry": "Consumer Electronics",
            "storyContents": {
                "project": "Sandra Fiske, Eng manager, wanted to migrate their tech stack to the jamstack to allow their content authors and devs to work independently and release changes more quickly.",
                "whyImportant": "This was important because their ecommerce business took off and the dev team tripled in a year.",
                "whyStatusQuoBad": "Their old architecture led to long build times as the team grew.",
                "quantifiedResults": "After transitioning to Netlify with headless Shopify, the team has seen a dramatic decrease in build times and and are transitioning all of their web properties."
            }
        },
        {
            "company": "Cornerstone OnDemand",
            "tags": ["Localization"],
            "industry": "B2B Software",
            "storyContents": {
                "project": "Trevor Smith, Director of web development, was working to improve the performance of their marketing sites and unlock their marketing team to make changes quickly to the site without dev resources.",
                "whyImportant": "This was important because there were 12+ international marketing sites with cross functional teams around the world making changes and updates.",
                "whyStatusQuoBad": "The existing architecture made it impossible for the team to make changes without IT resources, led to poor performing sites, and impacted their ability to hire great engineers.",
                "quantifiedResults": "After moving to Netlify, there are no longer any dependencies on IT or Devops to make site changes. Development tasks complete 30% faster, and page load times improved by over 25%."
            }
        },
        {
            "company": "HR Block Canada",
            "tags": ["Azure"],
            "industry": "Financial Services",
            "storyContents": {
                "project": "Hal Wong, Solutions Architect (Pixel Pusher Agency), was tasked with redesigning the marketing site for HR Block well before tax season.",
                "whyImportant": "This was important becuase Canada is a high growth region for HR Block and they wanted to improve their customer experience from previous poor reviews.",
                "whyStatusQuoBad": "Previous projects built on Azure with Wordpress took too long to build and were challenging to update because HRB's content authors were locked to the dev teams release cycle.",
                "quantifiedResults": "Hal built the new site on Netlify that met the demands of the traffic spikes around tax season, without any resources from the HR block cloud team. The content teams could now make updates to things like promotions in minutes leading up to tax season."
            }
        },
        {
            "company": "Yext",
            "tags": ["Dynamic Sites"],
            "industry": "B2B Software",
            "storyContents": {
                "project": "Liz Frailey, VP Platform, was tasked with building an enterprise LMS (learning management system) at Yext inspired by Salesforce Trailblazer.",
                "whyImportant": "This was important becuase Yext was a growing private company that wanted to enable their customers and user base to adopt Yext more quickly and easily.",
                "whyStatusQuoBad": "They could not accomplish this with their old architecture becuase they had a short timeline and only access to one frontend dev resource on the project.",
                "quantifiedResults": "Netlify enabled this single developer to launch the LMS project on time before their user conference. The marketing and content teams can now make changes instantly, and have adopted Netlify for future projects like conference sites."
            }
        },
        {
            "company": "Something Navy",
            "tags": ["Ecommerce"],
            "industry": "Fashion",
            "storyContents": {
                "project": "Brian Anderson, CEO (Nacelle, an agency), wanted to build an independent online store for his client.",
                "whyImportant": "This was important because Something Navy previously sold product through Nordstrom.com, but experienced several outages due to traffic spikes when new products dropped.",
                "whyStatusQuoBad": "They could not rely on Nordstrom.com, or buiild a new site themselves from scratch due to limited internal dev resources.",
                "quantifiedResults": "By building and hosting on Netlify, they were able to quickly ship a new site with a small team. The new site sold $1m+ in the first 30mins, with over 100k unique sessions."
            }
        },
        {
            "company": "Gemini",
            "tags": ["Next.js", "Vercel ⚔️"],
            "industry": "Crypto",
            "storyContents": {
                "project": "Chris Henderson, Software Developer, wanted to simplify the build and deploy process for their main marketing site.",
                "whyImportant": "This was important because Gemini has been in hypergrowth and needed more flexibiity in how their cross functional teams managed the marketing site.",
                "whyStatusQuoBad": "This was not possible before using Wordpress and AWS because they had significant overhead managing AWS problems with caching, redirects, and managing environments.",
                "quantifiedResults": "Gemini chose Netlify over Vercel after finding it had an easier to use dev workflow, more robust support and docs, and supported all the next.js functionality they required. "
            }
        },
        {
            "company": "Affirm",
            "tags": [],
            "industry": "Financial Services",
            "storyContents": {
                "project": "Erik Ketcham, Sr. Eng Manager, wanted to build and host new projects and sites (like demo sites, blog, event pages) without any resources from their internal infra team.",
                "whyImportant": "This was important because Affirm was growing and launching new products at a rapid pace, while still needing to meet strict security guidelines as a fintech coompany.",
                "whyStatusQuoBad": "This was not possible with their old architecture because site changes and updates required work from their core infra team and created a bottleneck with sales/marketing teams.",
                "quantifiedResults": "After Netlify passed all of their secruity requriements,  Affirm found the new architecture to be highly performant and allowed them to go to market more quickly with new sites."
            }
        },
        {
            "company": "Loblaw",
            "tags": [],
            "industry": "Retail & Ecommerce",
            "storyContents": {
                "project": "Sameer Rikhi, Director of Engineering, wanted to improve the performance of their sites and enable their dev team to ship products faster",
                "whyImportant": "This was important because Loblaw, as one of Canada's largest retailers, required high scalability becuase their sites reached over 7m users.",
                "whyStatusQuoBad": "Site perfomance and dev speed was challenging before because their monolithic tech stack led to siloed teams operating seperately",
                "quantifiedResults": "After moving to Netlify, Loblaw digital team has gove from shipping 9 products in 7 years to 11 products within the first 4 months. The overall budget for the tech stack decreased over 30% as Netlify enabled Loblaw to consolidate vendors."
            }
        },
        {
            "company": "Spring",
            "tags": ["Next.js", "Vercel ⚔️"],
            "industry": "Ecommerce",
            "storyContents": {
                "project": "Rick Takes, Director Engineering, wanted to migrate away from their monolithic architecture to improve site performance and scalability.",
                "whyImportant": "This was important becuase Teespring was going through a rebrand and change in business model to a marketplace offering unique sites for individual sellers on their platform.",
                "whyStatusQuoBad": "The old tech stack had too many moving parts in one huge code base that made it more and more challenging to make changes as their dev and marketing teams grew.",
                "quantifiedResults": "After migrating to a jamstack architecture, Spring was able to unlock their cross functional teams to make changes more quickly that led to faster partnership integration, better UX, a much faster time to market, and 15-20% increase in conversions. They went from 90-minute build times to 1 minute on Netlify HP Build.  Scale --> 2m individual storefronts, growing to 6m storefronts."
            }
        },
        {
            "company": "Celonis",
            "tags": ["EU", "WP Migration"],
            "industry": "B2B Software",
            "storyContents": {
                "project": "Pekka Hiltunen, Head of Web Design and Development, wanted to migrate away from Wordpress CMS and hosting to improve site performance.",
                "whyImportant": "This was important becuase Celonis was growing and planning more projects around events and international expansion.",
                "whyStatusQuoBad": "Their existing architecture led to 10 second page load times and prevented the content editors from publishing any changes themselves.",
                "quantifiedResults": "Since moving to Netlify, Celonis now publishes 100 new pages a month with a team of over 60 content authors free to make changes. Celonis significantly shaved down its time to first byte, from 7 seconds to 270ms, and saw $60K in cost savings from its previous WordPress setup."
            }
        },
        {
            "company": "Pan Macmillan",
            "tags": [],
            "industry": "Publishing",
            "storyContents": {
                "project": "James Luscombe, Technology Director, was working on migrating the tech stack for their main site to the jamstack.",
                "whyImportant": "This was important because, as a publisher, a jamstack architecture allowed their content editors the ability to deploy themselves from the CMS without needing resources fom their 3rd party development team.",
                "whyStatusQuoBad": "This was not possible previously when using Azure, which required coordination with the development team to make any changes. ",
                "quantifiedResults": "Since moving to Netlify, they have seen a 70% decrease in bounce rate, 25% increase in affiliate link clicks to retailers on their site while saving 20% of the overall tech budget."
            }
        },
        {
            "company": "Medallia",
            "tags": ["Nuxt.js", "Vue", "Prismic", "WP Migration"],
            "industry": "B2B Software",
            "storyContents": {
                "project": " Rob Kristie, Global Head of Web Development, led a migration from their existing Wordpress monolith.",
                "whyImportant": "This was important because, with Wordpress, the Marketing team dependent on Web team.  They could only deploy once a week, and it took 1-2hr per deploy.",
                "whyStatusQuoBad": "Their existing architecture made it impossible for the marketing team to make updates on its own and deploy more frequently.  And core web vitals didn't improve.",
                "quantifiedResults": "Since moving to Netlify, the Web team’s time is freed up from the grunt work they used to need to do any time a change was made, marketing can push multiple changes per week, and core web vitals (notably Largest Contentful Paint) have improved by 50% (2-3seconds to 700ms)."
            }
        },
        {
            "company": "Manscaped",
            "tags": ["Shopify", "Digital to Consumer"],
            "industry": "Ecommerce",
            "storyContents": {
                "project": "Preston Straight, Technical Lead at Manscaped, led a migration from their existing Shopify monolith.",
                "whyImportant": "This was important because, with their Shopify monolith, their efforts to internationalize their site were becomingly increasingly brittle and complex.",
                "whyStatusQuoBad": "Their existing architecture forced them to spend more time orchestrating the deployment process, and managing rollouts, and de-risking deployments, rather than focusing on their end-user's experience",
                "quantifiedResults": "Since moving to Netlify, the front-end team team now works out of a single codebase for all domestic and international sites, ships 700+ changes per moth, and has faster pages that are more SEO friendly."
            }
        },
        {
            "company": "UW Health",
            "tags": ["Next.js", "Contentful", "Monolith Migration"],
            "industry": "Healthcare",
            "storyContents": {
                "project": "Noah Locke, Director of Marketing Technology at UW Health, partnered with an agency, Last Rev, to migrate away from their Java-based, on-prem hosting and deploy infrastructure",
                "whyImportant": "This was important because the Marketing was needing to wait 1+ days for changes to go out the door, which was negatively impacting the user experience and collaboration between Marketing and Development",
                "whyStatusQuoBad": "Their existing architecture and process was blocking the teams from deploying faster. In addition, orchestration and maintenance of their on-prem servers took a lot of the Dev team's time",
                "quantifiedResults": "Since moving to Netlify with Contentful as their CMS, UW Health pushes builds out in 7 minutes, has improved collaboration with Marketing by using collaborative deploy previews, and have streamlined how updates are shipped, making their user experience much better and faster."
            }
        }
        
    ]
        
    
}